# 0)ახსენი  რას ნიშნავს “default value” ფუნქციის პარამეტრებში
# 1)დაწერე ფუნქცია greet(name="მეგობარო"), რომელიც ბეჭდავს ტექსტს f-string-ით:
#  გამარჯობა, {name}!
# 2)დაწერე ფუნქცია multiply(a, b=2), რომელიც აბრუნებს f-string-ით frazას:
#  "რიცხვების ნამრავლი არის {a * b}"
# 3)დაწერე ფუნქცია welcome(country="საქართველო"), რომელიც ბეჭდავს "კეთილი იყოს თქვენი მობრძანება <ქვეყანა>ში!"
# 4)დაწერე ფუნქცია power(base, exp=3), რომელიც აბრუნებს base-ის აღმავლობას exp ხარისხში
# 5)დაწერე ფუნქცია info(name, age=18), რომელიც ბეჭდავს "სახელი: <name>, ასაკი: <age>"





# 0)

# მაგ . . . 

# def test (name="მეგობარო"):
#     return"გამარჯობა " +  name

# print(test())    # გამოიტანს → გამარჯობა, მეგობარო

# print(test("გაბრიელ")) # გამოიტანს → გამარჯობა, გაბრიელ



# 1)

# def greet(name="მეგობარო"):
#     return"გამარჯობა " +  name

# print(greet())    # გამოიტანს → გამარჯობა, მეგობარო



# 2)


# def multiply(a, b=2):
#     return f"{a} * {b} = {a * b}"


# print(multiply(4))      # გამოიტანს: 4 * 2 = 8
# print(multiply(3, 5))   # გამოიტანს: 3 * 5 = 15


# 3)

# def welcome(country="საქართველო"):
#     return f"კეთილი იყოს თქვენი მობრძანება {country}ში!"



# welcome()              # გამოიტანს: კეთილი იყოს თქვენი მობრძანება საქართველოში!
# welcome("საფრანგეთი")  # გამოიტანს: კეთილი იყოს თქვენი მობრძანება საფრანგეთში!


# 4)


# def power(base, exp=3):
#     return base ** exp


# print(power(2))     
# print(power(3, 4))  


# 5)

# def info(name, age=14 ):
#     print(f"სახელი: {name}, ასაკი: {age}")


# მაგალითად:

# info("გაბრიელ 10")        
# info("ვატო")        