# 0) კომენტარებით ახსენით რა არის Exception და რას აკეთებს try და except.

# 1) მომხმარებელს შემოატანინეთ რიცხვი და გადააკეთეთ int-ად.
#    დაამუშავეთ ValueError.

# 2) მომხმარებელს შემოატანინეთ ორი რიცხვი და გაყავით ისინი.
#    დაამუშავეთ ZeroDivisionError.

# 3) შექმენით სია 5 ელემენტით და მომხმარებელს შემოატანინეთ ინდექსი.
#    დაამუშავეთ IndexError.

# 4) ერთ პროგრამაში გამოიყენეთ რამდენიმე except ბლოკი სხვადასხვა შეცდომისთვის.



# 0)
# Exception არის შეცდომა, რომელიც ხდება პროგრამის შესრულების დროს.
# try ბლოკი გამოიყენება კოდის ნაწილისთვის, რომელიც შეიძლება გამოიწვიოს შეცდომა, 
# ხოლო except ბლოკი გამოიყენება იმისთვის, რომ დაიჭიროს და დამუშავდეს ეს შეცდომა, რათა პროგრამა არ გაჩერდეს და მომხმარ





# 1)

try:
    number = int(input("შეიყვანეთ რიცხვი: "))

except ValueError:

    print("გთხოვთ, შეიყვანეთ სწორი რიცხვი.")







# 2)
try:
    num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))

    num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))

    result = num1 / num2

    print("გაყოფის შედეგი: ", result)

except ZeroDivisionError:

    print("გთხოვთ, მეორე რიცხვი არ იყოს ნული.")







# 3)

my_list = [1, 2, 3, 4, 5]

try:
    index = int(input("შეიყვანეთ ინდექსი (0-5: "))

    print("ელემენტი ინდექსზე", index, ":", my_list[index])


except IndexError:
    
    print("გთხოვთ, შეიყვანეთ ინდექსი 0-დან 5-მდე.")






# 4)

my_list = [10, 20, 30, 40, 50]

try:
    index = int(input("შეიყვანეთ ინდექსი (0-4): "))

    number = int(input("შეიყვანეთ რიცხვი, რომლითაც გავყოფთ: "))

    
    result = my_list[index] / number

    
    print("შედეგი:", result)


except ValueError:

    print("გთხოვთ, შეიყვანეთ მხოლოდ რიცხვები.")


except IndexError:

    print("ინდექსი უნდა იყოს 0-დან 4-მდე.")


except ZeroDivisionError:

    print("ნულზე გაყოფა არ შეიძლება.")

