
# 1) დაწერე პროგრამა, რომელიც კითხულობს მომხმარებლის ასაკს.

# თუ ასაკი 0–12 → „ბავშვი“

# თუ 13–19 → „თინეიჯერი“

# თუ 20–59 → „ზრდასრული“

# სხვა შემთხვევაში → „პენსიონერი“.

# 2) დაწერე პროგრამა, რომელიც კითხულობს რიცხვს.

# თუ რიცხვი 0-ზე ნაკლებია → „უარყოფითი“

# თუ ზუსტად 0–ია → „ნული“

# თუ 0-ზე მეტია და 100–ზე ნაკლებია → „პატარა რიცხვი“

# სხვა შემთხვევაში → „დიდი რიცხვი“.

# 3) დაწერე პროგრამა, რომელიც კითხულობს გამოცდის ქულას (0–100).

# თუ 90–100 → „A“

# თუ 80–89 → „B“

# თუ 70–79 → „C“

# თუ 60–69 → „D“

# სხვა შემთხვევაში → „F“.

# 4) დაწერე პროგრამა, რომელიც კითხულობს კვირის დღეს (რიცხვი 1–დან 7-მდე).

# თუ 1 → „ორშაბათი“

# თუ 2 → „სამშაბათი“

# თუ 3 → „ოთხშაბათი“

# თუ 4 → „ხუთშაბათი“

# თუ 5 → „პარასკევი“

# თუ 6 → „შაბათი“

# თუ 7 → „კვირა“.

# 5) დაწერე პროგრამა, რომელიც კითხულობს ტემპერატურას (ცელსიუსში).

# თუ ტემპერატურა < 0 → „ძალიან ცივა“

# თუ 0–15 → „გრილია“

# თუ 16–30 → „თბილია“

# თუ 31–40 → „ცხელა“

# სხვა შემთხვევაში → „უაღრესად ცხელა“.









# 1) 

age = int(input("შეიყვანე ასაკი: "))

if 0 <= age <= 12:
    print("ბავშვი")
elif 13 <= age <= 19:
    print("თინეიჯერი")
elif 20 <= age <= 59:
    print("ზრდასრული")
else:
    print("პენსიონერი")



# 2)

num = int(input("შეიყვანე რიცხვი: "))

if num < 0:
    print("უარყოფითი")
elif num == 0:
    print("ნული")
elif num > 0 and num < 100:
    print("პატარა რიცხვი")
else:
    print("დიდი რიცხვი")


# 3) 

score = int(input("შეიყვანე ქულა (0-100): "))

if 90 <= score <= 100:
    print("A")
elif 80 <= score <= 89:
    print("B")
elif 70 <= score <= 79:
    print("C")
elif 60 <= score <= 69:
    print("D")
else:
    print("F")



# 4)
day = int(input("შეიყვანე კვირის დღის ნომერი (1-7): "))

if day == 1:
    print("ორშაბათი")
elif day == 2:
    print("სამშაბათი")
elif day == 3:
    print("ოთხშაბათი")
elif day == 4:
    print("ხუთშაბათი")
elif day == 5:
    print("პარასკევი")
elif day == 6:
    print("შაბათი")
elif day == 7:
    print("კვირა")
else:
    print("არასწორი რიცხვი (უნდა იყოს 1-დან 7-მდე)")



# 5) 
temp = int(input("შეიყვანე ტემპერატურა (°C): "))

if temp < 0:
    print("ძალიან ცივა")
elif 0 <= temp <= 15:
    print("გრილია")
elif 16 <= temp <= 30:
    print("თბილია")
elif 31 <= temp <= 40:
    print("ცხელა")
else:
    print("უაღრესად ცხელა")