
# 0) გაიხსენე რა არის შედარებითი (==, !=, <, >) და ლოგიკური ოპერატორები (and, or, not)

# 1) შექმენი ორი ცვლადი: x = 5 და y = 10. დაბეჭდე x < y და ახსენი რას გამოიტანს

# 2) შექმენი ორი ცვლადი: a = 7 და b = 3. დაბეჭდე a > b და ახსენი რას ნიშნავს

# 3) შექმენი სამი ცვლადი: ასაკი = 17, აქვს_პირადობა = False, სტუდენტია = True. დაბეჭდე ასაკი >= 18 and აქვს_პირადობა

# 4) შექმენი ორი ცვლადი: მოსწონს_შოკოლადი = True და ჭამს_ჯანსაღად = False. დაბეჭდე მოსწონს_შოკოლადი or ჭამს_ჯანსაღად

# 5) შექმენი ცვლადი: არის_აქტიური = False. დაბეჭდე not არის_აქტიური და განმარტე რას ნიშნავს შედეგი



# 0)






#1)
x = 5
y = 10 
print(x<y)      #ახსენი რას გამოიტანს : ეს გამოიტანს true - ს იმიტომ რომ  ეს ნიშანი ( < ) არის ნაკლებობის ნიშანი და 5 ნაკლებია 10 - ზე


#2)
a = 7
b = 3
print(a>b) #  ახსენი რას გამოიტანს : ეს გამოიტანს true - ს იმიტომ რომ  ეს ნიშანი ( > ) არის მეტობის  ნიშანი და 7 მეტია 3 - ზე



#3)


age = 17
პირადობა_აქვს = False
სტუდენტია = True
print(age >= 18 and პირადობა_აქვს)



#4)

ჭამს_ჯანსაღად =  True

მოსწონს_შოკოლადი = False

print( მოსწონს_შოკოლადი or ჭამს_ჯანსაღად)



#5)

არის_აქტიური = False

print( not არის_აქტიური)            # 