
# 1) მოითხოვე მომხმარებლისგან სახელი `input()` ფუნქციით  
# 2) ცვლადში შეინახე მიღებული სახელი (მაგ. name)  
# 3) დაბეჭდე ტექსტი: "გამარჯობა, [სახელი]!"  
# 4) დაამატე კომენტარი, რომ ხსნის რას აკეთებს input  
# წარმატებები <3  
# 5) დაასრულეთ module 2 quiz


name = input("ჩაწერე თქწენი სახელი: ")
print("გამარჯობა, " + name + "!" )




#  input() ფუნქცია პითონში გამოიყენება მომხმარებლისგან ინფორმაციის მისაღებად. როდესაც input() ფუნქციას ვიძახებთ, პროგრამა ჩერდება და ელოდება მომხმარებლისგან რაიმეს შეყვანას. მომხმარებლის მიერ შეყვანილი ინფორმაცია შემდეგ შეგვიძლია შევინახოთ ცვლადში და გამოვიყენოთ ჩვენს პროგრამაში.
















