# 1) ახსენით რას აკეთებს lambda ფუნქცია

# 2) ახსენით თუ რატომ ვეძახით lambda ფუნქციას ანონიმურ ფუნქციას

# 3) შექმენით lambda ფუნქცია რომელიც მიღებულ რიცხვს გააორმაგებს

# 3) შექმენით lambda ფუნქცია რომელიც მიიღებს 2 რიცხვს და დააბრუნებს მათ ჯამს

# 4) შექმენით lambda ფუნქცია რომელიც მიიღებს რიცხვს და დააბრუნებს ეს რიცხვი ლუწია თუ კენტი

# 5) შექმენით lambda ფუნქცია რომელიც 2 რიცხვს შორის დააბრუნებს ყველაზე დიდს

# 6) შექმენით lambda ფუნქცია რომელიც დააბრუნებს მიღებული რიცხვის კვადრატს

# 7) შექმენით lambda ფუნქცია რომელიც დააბრუნებს სტრინგის სიგრძეს

# 8) შექმენით lambda ფუნქცია რომელიც მიიღებს არგუმენტად რიცხვების სიას და დააბრუნებს ყველაზე დიდ რიცხვს ამ სიაში

# 9) შექმენით lambda ფუნქცია რომელიც მიიღებს არგუმენტად რიცხვების სიას და დააბრუნებს ყველაზე პატარა რიცხვს ამ სიაში

# 10) შექმენით lambda ფუნქცია რომელიც მიიღებს არგუმენტად სტრინგს და დააბრუნებს ამ სტრინგს შებრუნებულს




# 1) lambda ფუნქცია არის ანონიმური ფუნქცია lambda ის არ აქვს სახელი
# და შეიძლება დაწერილ იქნეს ერთ ხაზში მოკლედ ადვილია გასაკეთებლად



# 2) 
# lambda ფუნქციას ვეძახით ანონიმურ ფუნქციას რადგან მას არ აქვს სახელი


# 3) 

gamravleba = lambda x: x * 2

print(gamravleba(5)) 

print(gamravleba(6)) 

# 4)

gayopa = lambda x : x % 2 == 0

print(gayopa(4))

print(gayopa(5))


# 5)

didi_parata = lambda x, y: max(x, y)

print(didi_parata(3, 7))


# 6)

kvadrati = lambda x: x * x

print(kvadrati(5))


# 7)

sigrze = lambda x: len(x)

print(sigrze("hi am gabriel"))


# 8)

didi_ricxvi = lambda list: max(list)

print(didi_ricxvi([10, 20, 30, 40, 50]))


# 9)

patara_ricxvi = lambda list: min(list)

print(patara_ricxvi([10, 20, 30, 40, 50]))


# 10)

sebruneba = lambda x : x[::-1]

print(sebruneba("hello world"))

