# 1) ახსენე კომენტარებით რა არის tuple და რა განსხვავებაა მასსა და list-ს შორის

# 2) შექმენი tuple, სადაც იქნება 3 ელემენტი: სახელი, ასაკი და ქალაქი

# 3) გამოიტანე tuple-ის პირველი ელემენტი კონსოლში (ან print-ით)

# 4) სცადე tuple-ის რომელიმე ელემენტის შეცვლა და დააკვირდი რა მოხდება

# 5) შექმენი tuple 5 რიცხვით და გამოიტანე მისი სიგრძე (length / len)



# 1)

# დასკვნა:

# თუფლი (tuple) და ლისთი (list) არის ორივე მონაცემთა სტრუქტურები Python-ში, რომლებიც გამოიყენება მონაცემების შენახვისთვის.

# tuple :

#თუფლი არის უცვლელი (immutable), რაც ნიშნავს, რომ მისი ელემენტები არ შეიძლება 
# შეიცვალოს, დამატება ან წაშლა შექმნის შემდეგ.

# list : 
# ლისთი კი არის ცვლადი (mutable), რაც ნიშნავს, რომ მისი ელემენტები შეიძლება შეიცვალოს, დამატება ან წაშლა ნებისმიერ დროს


# 2)

my_info = ("gabriel todua", 10, "tbilisi")


# 3)

print(my_info[0])

# 4)

# my_info[1] = 11  ერორის გამოიტანს აი ესეთ ერორის 

# gabriel todua
# Traceback (most recent call last):
#   File "", line 39, in <module>
#     my_info[1] = 11
#     ~~~~~~~^^^
# TypeError: 'tuple' object does not support item assignment


# 5)

numbers_tuple = (5, 10, 15, 20, 25)

print(len(numbers_tuple))

# output: 5
