# 0) ახსენით რა არის განსხვავება თუფლს და ლისთის შორის
# 1) შექმენით თუფლი და გამოიყენეთ მასზე unpackingი





# 0)

# დასკვნა:

# თუფლი (tuple) და ლისთი (list) არის ორივე მონაცემთა სტრუქტურები Python-ში, რომლებიც გამოიყენება მონაცემების შენახვისთვის.

# tuple :

#თუფლი არის უცვლელი (immutable), რაც ნიშნავს, რომ მისი ელემენტები არ შეიძლება 
# შეიცვალოს, დამატება ან წაშლა შექმნის შემდეგ.

# list : 
# ლისთი კი არის ცვლადი (mutable), რაც ნიშნავს, რომ მისი ელემენტები შეიძლება შეიცვალოს, დამატება ან წაშლა ნებისმიერ დროს




# 1)

my_tuple = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10 , 11, 12, 13, 14, 15 ,16, 17, 18, 19, 20 ,21, 22, 23, 24, 25, 26)

a, b, c, d, e, f, g, h, i, j, k, l, m, n, o, p, q, r, s, t, u, v, w, x, y, z = my_tuple

