# 2) კომენტარებით ახსენით რას აკეთებს *rest ოპერატორი
# 3) შექმენით თუფლი, რომელზეც გამოიყენებთ *rest ოპერატორს



# 2)

# *rest ოპერატორი გამოიყენება unpacking-ის დროს, რათა დააკავშიროს დარჩენილი ელემენტები ერთ ცვლადში, რომელიც იქნება ლისთი.
# ეს საშუალებას გვაძლევს გავყოთ თუფლი ან ლისთი რამდენიმე ცვლადში, სადაც ერთი ცვლადი იღებს ყველა დანარჩენ ელემენტს.

# 3)
my_tuple = (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

a, b, *rest = my_tuple

print("a:", a)           # a: 1
print("b:", b)           # b: 2
print("rest:", rest)     # rest: [3, 4, 5, 6, 7, 8, 9, 10]
