# 2)შექმენით 2 ცვლადი, თქვენი სახელი და თქვენი ასაკი, შემდეგ შექმენით ლისთი სახელად info სადაც შეინახავთ ამ ცვლადებს
# 3)შექმენით სტრინგი სადაც შეინახავთ მშობლის სახელს, შემდეგ შეცვალეთ ამ სტრინგში მეორე სიმბოლოლ
# 4)კომენტარებით დაწერეთ, რატომ არ შეგვიძლია სტრინგის შეცვლა



#2)


# name = "gabrieli"

# age = 9

# info = [name,age]




#3)


# parent_name = "lika,rezi"

# parent_name [2] = "a"

# print(parent_name)


#4)

# Python-ში სტრინგი არის IMMUTABLE (უცვლადი ობიექტი).
# ეს ნიშნავს, რომ მისი შიგნით სიმბოლოს პირდაპირ შეცვლა შეუძლებელია:
# მაგალითად -> parent_name[2] = "a" გამოიტანს შეცდომას.


