# 1) ახსენით რას აკეთებს list comprehension
# 2) შექმენით რიცხვების სია და list comprehension-ის გამოყენებით დააბრუნეთ ახალი სია რომელშიც იქნება ყველა რიცხვი გაორმაგებული




# 1)

# List comprehension არის Python-ის ფუნქცია, რომელიც საშუალებას გვაძლევს შევქმნათ ახალი სია არსებული სიის ელემენტებისგან
# გაკეთება რაღაცეების ან გააორმაგტო ან წაშამო და ყველაზე მთავარი ის არის რომ ყველაფერი ერთ ხაზში წერ კოდს. 

# 2)

numbers = [1, 2, 3, 4, 5]

num_main = [num * 2 for num in numbers]

print(num_main)

