# 0) ახსენი ერთ წინადადაში რას აკეთებს while loop და როდის ჩერდება

# 1) დაწერე while loop, რომელიც ბეჭდავს რიცხვებს 0-დან 4-მდე

# 2) დაწერე while loop, რომელიც ბეჭდავს "გამარჯობა" სანამ counter ცვლადი ნაკლებია 3-ზე

# 3) დაწერე while loop, რომელიც თვლის 1-იდან 5-მდე და როცა რიცხვი ტოლია 3-ს — დაბეჭდავს "საშუალო"

# 4) დაწერე while loop, რომელიც თვლის 1-იდან 5-მდე და დაბეჭდავს მხოლოდ მაშინ როცა რიცხვი მეტია 2-ზე

# 5) დაწერე while loop, რომელიც ამთავრებს მუშაობას (break) თუ counter ცვლადი უდრის 4-ს





#0)
#while loop იყენებს მოცემულ პირობას და იმეორებს კოდს მანამ, სანამ ეს პირობა მართალია, ხოლო როცა პირობა false გახდება, ციკლი შეწყდება.


#1)

i = 0
while i < 5:
    print(i)
    i += 1


#3)


i = 1
while i <= 5:
    if i == 3:
        print("საშუალო")
    else:
        print(i)
    i = i + 1     



#4)

num = 1

while num <= 5:
    if num > 2:
        print(num)
    num += 1    




#5)

counter = 1

while True:
    if counter == 4:
        break
    print(counter)
    counter += 1
