# 📝 დავალება 1
# letters = ["ა", "ბ", "გ", "დ", "ე", "ვ", "ზ", "თ", "ი", "კ"]


# გააკეთე slicing-ით:

# პირველი 5 ასო.

# ბოლო 3 ასო.

# უკუღმა პირველი 6 ასო.

# 📝 დავალება 2
# nums = [5, 10, 15, 20, 25, 30, 35, 40]


# გააკეთე slicing-ით:

# თითოეული მეორე ელემენტი.

# თითოეული მესამე ელემენტი.

# ბოლო ოთხი ელემენტი უკუღმა.

# 📝 დავალება 3
# word = "პითონისსლაისინგი"


# გააკეთე slicing-ით:

# "პითონი"

# "სლაისინგი"

# "იგნისია" (უკუღმა ყოველ მეორე ასოზე).

# 📝 დავალება 4
# nums = [100, 200, 300, 400, 500, 600, 700, 800, 900]


# გააკეთე slicing-ით:

# პირველი ნახევარი.

# მეორე ნახევარი.

# მთელი სია უკუღმა.

# 📝 დავალება 5
# text = "გამარჯობაყველას"


# გააკეთე slicing-ით:

# "გამარჯობა"

# "ყველას"




#1)


# letters = ["ა", "ბ", "გ", "დ", "ე", "ვ", "ზ", "თ", "ი", "კ"]

# # პირველი 5 ასო
# print(letters[:5])   # ['ა', 'ბ', 'გ', 'დ', 'ე']

# # ბოლო 3 ასო
# print(letters[-3:])  # ['თ', 'ი', 'კ']

# # უკუღმა პირველი 6 ასო
# print(letters[:6][::-1])  # ['ვ', 'ე', 'დ', 'გ', 'ბ', 'ა']


#2)


# nums = [5, 10, 15, 20, 25, 30, 35, 40]

# print(nums [::2])
# print(nums [::3])
# print(nums [-1:-6])


#3)

# word = "პითონისსლაისინგი"

# # "პითონი"
# print(word[:6])   # პითონი

# # "სლაისინგი"
# print(word[7:])   # სლაისინგი

# # "იგნისია" (უკუღმა ყოველ მეორე ასოზე)
# print(word[::-2])  # იგნისია




#4)

# nums = [100, 200, 300, 400, 500, 600, 700, 800, 900] # 900 არ იყოფა

# print(nums[0:4])
# print(nums[4:-1])
# print(nums[::-1])  




#5)

# text = "გამარჯობაყველას"

# print(text[0:9])
# print(text[9:15])