# 📝 დავალება 1
# nums = [10, 20, 30, 40, 50]


# გააკეთე:

# დაბეჭდე პირველი ელემენტი.

# დაბეჭდე ბოლო ელემენტი.

# მეორე ელემენტი შეცვალე 200-ით.

# შუა ელემენტი (30) შეცვალე 999-ით.

# ბოლო ელემენტი შეცვალე 5000-ით.

# 📝 დავალება 2
# letters = ["ა", "ბ", "გ", "დ", "ე"]


# გააკეთე:

# დაბეჭდე მესამე ასო.

# დაბეჭდე ბოლო ასო.

# პირველი ასო შეცვალე "ზ"-ით.

# მესამე ასო შეცვალე "თ"-ით.

# ბოლო ასო შეცვალე "ი"-თ.

# 📝 დავალება 3
# mix = ["apple", 25, True, 3.14]


# გააკეთე:

# დაბეჭდე "apple".

# დაბეჭდე 3.14.

# "apple" შეცვალე "banana"-თი.

# True შეცვალე False-ით.

# 25 შეცვალე 100-ით.

# 📝 დავალება 4
# words = ["კატა", "ძაღლი", "თაგვი", "კურდღელი", "ძროხა"]


# გააკეთე:

# დაბეჭდე პირველი ცხოველი.

# დაბეჭდე მესამე ცხოველი.

# მეორე ცხოველი შეცვალე "ვირი"-თი.

# მესამე ცხოველი შეცვალე "ლომი"-თი.

# ბოლო ცხოველი შეცვალე "ვეფხვი"-თი.

# 📝 დავალება 5
# nums = [5, 15, 25, 35, 45, 55]


# გააკეთე:

# დაბეჭდე მეორე ელემენტი.

# დაბეჭდე მეხუთე ელემენტი.

# პირველი ელემენტი შეცვალე 0-ით.

# მესამე ელემენტი შეცვალე 333-ით.

# მეხუთე ელემენტი შეცვალე 999-ით.








#1)

nums = [10, 20, 30, 40, 50]
print(nums[0])
print(nums[4])
nums [2] = 200
nums [2] = 999
nums [2] = 5000


#2)

letters = ["ა", "ბ", "გ", "დ", "ე"] 
print(letters[3])
print(letters[4])
letters[0] = "ზ"
letters[3] = "თ"
letters[4] = "ი"

#3)



mix = ["apple", 25, True, 3.14]
print(mix[0])
print(mix[3])
mix[0] = "banana"
mix[2] = "False"
mix[1] = "100"


#4)


words = ["კატა", "ძაღლი", "თაგვი", "კურდღელი", "ძროხა"]
print(words[0])
print(words[3])
words[2] = "ვირი"
words[3] = "ლომი"
words[4] = "ვეფხვი"


#5)


nums = [5, 15, 25, 35, 45, 55]
print(nums[2]) 
print(nums[5]) 
nums[0] = 0
nums[3] = 333
nums[5] = 999