# 0)კომენტარებით დაწერეთ, რატომ ვიყენებთ elifს რამდენიმე ifის ნაცვლად
# 1)მომხმარებელს შემოატანინეთ ასაკი, შემდეგ თუ ეს ასაკი არის 10 წლის ან მეტის გამოიტანეთ "Child discount" თუ არის 64ის ან მეტის,
# გამოიტანეთ "elderly discount", სხვა ყველა შემთხვევაში გამოიტანეთ "regular price"



#0)



# x = 10
# if x > 5:
#     print("მეტი ვიდრე 5")
# if x > 8:
#     print("მეტი ვიდრე 8")


# აქ ორივე დაიბეჭდება, რადგან ორივე if ცალ-ცალკეა.
# მაგრამ თუ გვინდა მხოლოდ ერთი პასუხი:


# x = 10
# if x > 8:
#     print("მეტი ვიდრე 8")
# elif x > 5:
#     print("მეტი ვიდრე 5")
# else:
#     print("5 ან ნაკლებია")


# აქ მხოლოდ "მეტი ვიდრე 8" დაიბეჭდება, რადგან პირველი პირობა შესრულდა და სხვებს ვეღარ ამოწმებს.
# ეფექტურობა





#1)



age = int(input("შეიყვანეთ თქვენი ასაკი: "))


if age >= 64:
    print("elderly discount")
elif age >= 10:
    print("Child discount")
else:
    print("regular price")