# 2) შექმენით ლისთი, სადაც შეინახავთ სახელებს, შემდეგ, მომხმარებელს შემოატანინეთ ინტეჯერი, თუ ეს ინტეჯერი არის ინდექსი ლისთში გამოიტანეთ ამ ინდექსზე მდგონი ელემენტი, წინააღმდეგ შემთხვევაში გამოიყენეთ raise და გამოიტანეთ ერორი
# 3)მომხმარებელს შემოატანინეთ ინტეჯერი. თუ ეს რიცხვი არის დადებითი და 10-ზე მეტია — დაბეჭდეთ "OK". წინააღმდეგ შემთხვევაში გამოიყენეთ raise და გამოიტანეთ ერორი (მაგ: "რიცხვი უნდა იყოს დადებითი და 10-ზე მეტი").





# 2)

names = ["gabrieli", "gabi", "vaxo", "gurami", "luka"]


try:

    index = int(input("შეიყვანეთ ინდექსი: "))

    if 0 <= index < len(names):

        print("ელემენტი ინდექსზე :",index, names[index])

    else:

        raise IndexError("ინდექსი ლისთის ფარგლებს გარეთაა.")
    
except ValueError:

    print("გთხოვთ, შეიყვანეთ სწორი ინტეჯერი.")

except IndexError :
    print("ინდექსი ლისთის ფარგლებს გარეთაა.")
    







# 3)

try:

    num = int(input("შეიყვანეთ რიცხვი: "))

    if num > 0 and num > 10:
        print("OK")

    else:

        raise ValueError("რიცხვი უნდა იყოს დადებითი და 10-ზე მეტი.")
    
except ValueError :
    print("რიცხვი უნდა იყოს დადებითი და 10-ზე მეტი.")