# 0 )შექმენით lambda ფუნქცია, რომელიც მიღებულ რიცხვს 1-ით გაზრდის

# 1) შექმენით lambda ფუნქცია, რომელიც მიიღებს 2 რიცხვს და დააბრუნებს მათ ნამრავლს

# 2) შექმენით lambda ფუნქცია, რომელიც შეამოწმებს არის თუ არა გადაცემული რიცხვი 10-ზე მეტი (დააბრუნოს True ან False)

# 3) შექმენით lambda ფუნქცია, რომელიც მიიღებს სტრინგს და დააბრუნებს მის პირველ სიმბოლოს

# 4) შექმენით lambda ფუნქცია, რომელიც მიიღებს რიცხვს და დააბრუნებს მის უარყოფით ვერსიას (მაგალითად: 5-ის შემთხვევაში -5)



# 1)

add = lambda x : x + 1

print(add(0)) 

print(add(1)) 

print(add(2)) 

print(add(3)) 






# 2)

multi = lambda x , y : x * y 

print(multi(10,10))







# 3)

pirveli = lambda x : x[:1]

print(pirveli("gabrieli"))




# 4)

nagativi = lambda x : x - x*2

print(nagativi(100))

