# 1) შექმენით ფუნქცია სახელწოდებით sum, რომელსაც არგუმენტად გადაეცემა 3 რიცხვი და ფუნქციის მიზანი იქნება, რომ ამ სამი რიცხვის ჯამი დააბრუნოს.

# 2) შექმენით ფუნქცია სახელწოდებით substract, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების სხვაობა.

# 3)  შექმენით ფუნქცია სახელწოდებით multiply, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების ნამრავლი.

# 4) შექმენით ფუნქცია სახელწოდებით divide, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების განაყოფი.





# 1)


# def sum(a,b,c):
    
#     print(a+b+c)

# sum(1,2,3)



# 2)


# def substract(a,b):

#     print(a-b)


# substract(10,5)




# 3)




#  def multiply (a,b):

#     print(a-b)


# multiply(100,5)


# 4)

# def divide (a,b):

#     print(a/b)


# divide(100,20)
