# 2) ჩამოწერეთ ყველა slicing ტექნიკა, რომელიც ვისწავლეთ(გადახედეთ რესურსებს)
# 3)nums = [2, 4, 6, 8, 10, 12, 14, 16, 18]
# დავალება:

# slicing-ით აიღე პირველი ოთხი რიცხვი.

# slicing-ით აიღე შუა ოთხი რიცხვი.

# slicing-ით მიიღე სია უკუღმა, მაგრამ ყოველ მეორე ელემენტზე.




#2)



# nums = [1, 25, 15, 30, 45, 60, 75, 90, 105, 120]

# print("1️ Normal slicing [0:3]       ->", nums[0:3])      # [1, 25, 15]
# print("2️ Negative slicing [-3:-1]   ->", nums[-3:-1])    # [90, 105]
# print("3️ Continue from index [3:]   ->", nums[3:])       # [30, 45, 60, 75, 90, 105, 120]
# print("4️ Continue to index [:5]     ->", nums[:5])       # [1, 25, 15, 30, 45]
# print("5️ Skipping elements [::2]    ->", nums[::2])      # [1, 15, 45, 75, 105]
# print("6️ Reverse slicing [::-1]     ->", nums[::-1])     # [120, 105, 90, 75, 60, 45, 30, 15, 25, 1]
# print("7️ Middle + step [2:8:2]      ->", nums[2:8:2])    # [15, 45, 75]
# print("8️ Backward step [6:2:-1]     ->", nums[6:2:-1])   # [75, 60, 45]
# print("9️ Full copy [:]              ->", nums[:])        # [1, 25, 15, 30, 45, 60, 75, 90, 105, 120]



#3)



nums = [1, 25, 15, 30, 45, 60, 75, 90, 105, 120]

# slicing-ით აიღე პირველი ოთხი რიცხვი
print("პირველი ოთხი:", nums[:4])        # [1, 25, 15, 30]

# slicing-ით აიღე შუა ოთხი რიცხვი
print("შუა ოთხი:", nums[3:7])           # [30, 45, 60, 75]

# slicing-ით მიიღე სია უკუღმა, მაგრამ ყოველ მეორე ელემენტზე
print("უკუღმა ყოველ მეორე:", nums[::2]) # [120, 90, 60, 30, 25]








