# 0) შექმენით ლისთი, რომელშიც ჩამოწერთ 10 ელემენტს, შემდეგ გამოიტანეთ პირველი ელემენტი positive indexingით, შემდეგ კი ბოლო ელემენტი negative indexingით
# 1) შექმენით ლისთი სახელად family, შემდეგ ამ ლისთის შიგნით შექმენით კიდევ რამდენიმე ლისთი სადაც შეინახავთ თქვენი ოჯახის ინფორმციას





#0)


number = [1,2,3,4,5,6,7,8,9,10]
print(number[0])
print(number[-1])




#1)


family = [["რაზი ანუ მამა" "წლოვანება : 41" ],["ლიკა ანუ დედა" "წლოვანება : 38" ],["ანდრია ანუ ძმა" "წლოვანება : 8" ],["ლუკა ანუ ძმა" "წლოვანება : 8 - თვის"],["გაბრიელი ანუ მე " "წლოვანება : 10"]]





