# 📝 დავალება 1

# შექმენი სია nums = [10, 20, 30, 40].

# გამოიყენე append() რომ დაამატო 50.

# გამოიყენე insert() რომ ჩასვა 15 ინდექსზე 1-ზე.

# 📝 დავალება 2

# შექმენი სია fruits = ["ვაშლი", "მსხალი", "ბალი", "ატამი", "მსხალი"].

# იპოვე "მსხალი"-ს ინდექსი (index()).

# დაითვალე "მსხალი" რამდენჯერ არის სიაში (count()).

# 📝 დავალება 3

# შექმენი სია letters = ["კ", "ბ", "ა", "გ", "დ"].

# დაალაგე ასოები ანბანის მიხედვით (sort()).

# შემდეგ წაშალე "გ" (remove()).

# 📝 დავალება 4

# შექმენი სტრიქონი text = "python is fun".

# გადააქციე ყველა ასო დიდ ასოებად (upper()).

# მერე გადააქციე პატარა ასოებად (lower()).

# 📝 დავალება 5

# შექმენი სია nums = [5, 10, 15, 20, 25].

# წაშალე ბოლო ელემენტი pop()-ით და დაბეჭდე რომელი წაიშალა.

# მიღებულ სიაში ჩასვი "100" ინდექსზე 2-ზე (insert()).






# 1)


nums = [10, 20, 30, 40]


nums.append(50)


nums.insert(1, 15)

print(nums)



# 2)


fruits = ["ვაშლი", "მსხალი", "ბალი", "ატამი", "მსხალი"]

fruits.index("მსხალი")

fruits.count("მსხალი")




# 3)

letters = ["კ", "ბ", "ა", "გ", "დ"]

letters.sort()        # ალაგებს ანბანის მიხედვით
letters.remove("გ")   # შლის "გ"

print(letters)




# 4)




text = "python is fun"

print(text.upper())

print(text.lower())





# 5)



nums = [5, 10, 15, 20, 25]

removed = nums.pop()

print("წაიშალა:", removed)


nums.insert(2, 100)

print("სიახლე სია:", nums)
