// 0 - კომენტარებიტ ახსენით რატომ ვიყენებტ კომპონენტებს ცალკე ფოლდერსი
// 1 - სექმენიტ საიტი, სადაც გექნებატ header და main body, გამოიყენეტ კომპონენტები
// 2 - პირველ და მეორე დავალებაში შექმნილ საიტს დაამატეთ ღილაკი და P თეგი, სადაც შეინახავთ 0ს, 
// ღილაკზე დაჭერისას p თეგის შიგნით რიცხვს მოემატოს 1




// 0
// რომ ისინი იყოს ორგონაზებული და კიდე საიტიც სწრაფდება შედარებით

// 1

import MainBody from "./Component/main body/main_body"

function App() {
  return (
      <MainBody />
  )
}

export default App
