# 0)კომენტარებით ახსენით, რა არის ფუნქციები
# 1)ნასწავლი სტრინგის ფუნქციებიდან, გამოიყენეთ ყველა და კომენტარებით გვერდზე მიუწერეთ რას აკეთებს




# 0)

# თქვენ მას სახელს აძლევთ → რათა საჭიროების შემთხვევაში გამოიძახოთ შეგიძლიათ გადასცეთ მას მონაცემები 
# (შემავალი მონაცემები/პარამეტრები) → რათა მან იცოდეს, რასთან იმუშაოს ის ასრულებს თავის ინსტრუქციებს → „სამუშაოს“, რისთვისაც შეიქმნა
# მას შეუძლია უკან რაღაც გასცეს (გამომავალი/დაბრუნებული მნიშვნელობა) → მისი მუშაობის შედეგი.


# 1)


I_am_gabriel = " hello I am gabriel !!! "




print(I_am_gabriel.upper()) #.upper - ყველა ასო დიდად აქცევს
print(I_am_gabriel.lower()) #.lower - ყველა ასო პატარა ხდის
print(I_am_gabriel.capitalize()) #.capitalize - პირველი ასო დიდად აქცევს, დანარჩენი პატარა ხდის
print(I_am_gabriel.title()) #.title - ყველა სიტყვის პირველი ასო დიდად აქცევს
print(I_am_gabriel.find("g")) #.find - ეძებს სტრიქონში კონკრეტულ სიტყვას და აბრუნებს იმ ინდექსს თუ სად მდებარეობს ეს სიტყვა, თუ არ მოიძებნა აბრუნებს -1
print(I_am_gabriel.count("h"))#.count - ითვლის რამდენჯერ არის გამოყენებული კონკრეტული ასო ან სიტყვა სტრინგში






