# 2) კომენტარებით ახსენით რა არის error handling და რაში გვეხმარება ის
# 3) დაწერეთ კოდი სადაც გამოიყენებთ tryს და exceptს



# 2)


# Error handling არის პროგრამირების ტექნიკა, რომელიც საშუალებას გვაძლევს გავუმკლავდეთ და მოვაგვაროთ შეცდომები
# რომლებიც შეიძლება წარმოიშვას პროგრამის შესრულების დროს. ეს ტექნიკა გვეხმარება თავიდან ავიცილოთ პროგრამის კრაშები
# და უზრუნველვყოთ რომ ჩვენი პროგრამა მუშაობს სტაბილურად მიუხედავად იმისა რომ გარკვეული შეცდომები შეიძლება მოხდეს.
# მაგალითად კოდი : 
# 
# Errors = [1, "Two", 3, "Four", 5]

# try:
#     print(sum(Errors))
# except TypeError:
#     print("error in this code")


# 3)

Errors = [1, "Two", 3, "Four", 5]

try:
    print(sum(Errors))
except TypeError:
    print("error in this code")