# 0) ჩამოწერეთ ყველა შეცდომის სახე პითონში
# 1) ჩამოწერეთ ყველა ერორის ტიპი პითონში და გვერდზე მიუწერეთ მაგელითები


# 0)



# 1 . Bug

# age = 18
# if age > 18:   # უნდა იყოს >=
#     print("Adult")




# 2 . Exception

# print(10 ==== 0)





# 3 . ValueError

# int("hello")




# 4 . SyntaxError

# print("Hello"





# 6 . NameError

# არსად არის ცვლადი 
# print(x)





# 7 . IndexError

# nums = [1, 2, 3]
# print(nums[5])





# 8 . TypeError

# 5 + "10"



# 1)

# Bug (ლოგიკური შეცდომა) – შეცდომა, რომლის დროსაც პროგრამა მუშაობას აგრძელებს, მაგრამ შედეგი არასწორია, რადგან ლოგიკა არასწორად არის დაწერილი.



# Exception (გამონაკლისი) – შეცდომა, რომელიც პროგრამის მუშაობის დროს ჩნდება და აჩერებს კოდის შესრულებას.



# ValueError – ჩნდება მაშინ, როცა მონაცემის ტიპი სწორია, მაგრამ მისი მნიშვნელობა არასწორია (მაგალითად, ტექსტის გადაყვანა რიცხვად, როცა ტექსტი რიცხვი არ არის).



# SyntaxError – ჩნდება მაშინ, როცა კოდი არასწორი სინტაქსით არის დაწერილი (მაგალითად, აკლია ფრჩხილი ან ბრჭყალები).



# NameError – ჩნდება მაშინ, როცა ვიყენებთ ცვლადს, რომელიც არ არის გამოცხადებული.



# IndexError – ჩნდება მაშინ, როცა ვცდილობთ მივწვდეთ სიის ელემენტს იმ ინდექსით, რომელიც არ არსებობს.



# TypeError – ჩნდება მაშინ, როცა ოპერაციას ვაკეთებთ ერთმანეთთან შეუთავსებელ მონაცემთა ტიპებზე (მაგალითად, რიცხვისა და ტექსტის 
# შეკრება ან ტექსტის გადაყვანა რიცხვად).

